Documents/ДисциплинарноеВзыскание.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Document>
		<Properties>
			<Name>ДисциплинарноеВзыскание</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>InformationRegister.Наставничество</xr:Item>
				<xr:Item>InformationRegister.СведенияОДисциплинарныхВзысканиях</xr:Item>
				<xr:Item>InformationRegister.ЗначенияПериодическихПоказателейРасчетаЗарплатыСотрудников</xr:Item>
				<xr:Item>InformationRegister.БухучетНачисленийСотрудников</xr:Item>
				<xr:Item>InformationRegister.ПлановыеНачисления</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Взыскание</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Взыскания</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаСобытия</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДолжностьРаботникаКадровойСлужбы</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Должности</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДолжностьРуководителя</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Должности</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Инициатор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Comment>Любая дополнительная информация</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КраткийСоставДокумента</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОснованиеПодписиРаботникаКадровойСлужбы</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ОснованиеПодписи</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОснованиеПодписиРуководителя</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ОснованиеПодписи</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Подразделение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПодразделенияОрганизаций</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РаботникКадровойСлужбы</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Руководитель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЗавершитьНаставничество</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Сотрудники</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ДатаНачала</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДатаОкончания</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сотрудник</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ФизическоеЛицо</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Взыскание</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Взыскания</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ДополнительныеРеквизиты</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Свойство</Name>
							<Type>
								<v8:Type>cfg:ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.ДополнительныеРеквизитыИСведения</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТекстоваяСтрока</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Наставники</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Наставник</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Наставляемый</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.УчастникПроцессаНаставничества</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДатаОкончания</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДокументОснование</Name>
							<Type>
								<v8:Type>cfg:DocumentRef.НазначениеНаставника</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Начисление</Name>
							<Type>
								<v8:Type>cfg:ChartOfCalculationTypesRef.Начисления</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ОтменитьДоплату</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СовокупнаяТарифнаяСтавка</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.ЗначениеПоказателяРасчетаЗарплаты</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВидТарифнойСтавки</Name>
							<Type>
								<v8:Type>cfg:EnumRef.ВидыТарифныхСтавок</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

Documents/ДисциплинарноеВзыскание/Ext/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

// СтандартныеПодсистемы.ВерсионированиеОбъектов

// Определяет настройки объекта для подсистемы ВерсионированиеОбъектов.
//
// Параметры:
//  Настройки - Структура - настройки подсистемы.
Процедура ПриОпределенииНастроекВерсионированияОбъектов(Настройки) Экспорт

КонецПроцедуры

// Конец СтандартныеПодсистемы.ВерсионированиеОбъектов
#Область ДляВызоваИзДругихПодсистем

// СтандартныеПодсистемы.УправлениеДоступом

// См. УправлениеДоступомПереопределяемый.ПриЗаполненииСписковСОграничениемДоступа.
Процедура ПриЗаполненииОграниченияДоступа(Ограничение) Экспорт
	Ограничение.Текст =
	"РазрешитьЧтениеИзменение
	|ГДЕ
	|	ЗначениеРазрешено(Организация)
	|	И ДляВсехСтрок(ЗначениеРазрешено(Сотрудники.ФизическоеЛицо, NULL КАК ИСТИНА) )";
КонецПроцедуры

// Конец СтандартныеПодсистемы.УправлениеДоступом

#КонецОбласти

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

#Область ОбработчикиПравилРегистрации

// См. ЗарплатаКадрыРасширенныйСинхронизацияДанных.ШаблонОбработчика
Процедура ПриЗаполненииНастроекОбработчиковПравилРегистрации(Настройки) Экспорт
	ЗарплатаКадрыРасширенныйСинхронизацияДанных.ДляОтбораПоОрганизации(Настройки);
	ЗарплатаКадрыРасширенныйСинхронизацияДанных.ДляОбъектаСПрисоединеннымиФайлами(Настройки);
КонецПроцедуры

#КонецОбласти

// Возвращает описание состава документа
//
// Возвращаемое значение:
//  Структура - см. ЗарплатаКадрыСоставДокументов.НовоеОписаниеСоставаОбъекта.
Функция ОписаниеСоставаОбъекта() Экспорт
	
	МетаданныеДокумента = Метаданные.Документы.ДисциплинарноеВзыскание;
	Возврат ЗарплатаКадрыСоставДокументов.ОписаниеСоставаОбъектаПоМетаданнымФизическиеЛицаВТабличныхЧастях(МетаданныеДокумента);
	
КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция ПолучитьДанныеДляПроведения(Ссылка) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ДисциплинарноеВзыскание.ДатаНачала КАК Период,
		|	ДисциплинарноеВзыскание.ДатаНачала КАК ДатаНачала,
		|	ДисциплинарноеВзыскание.Сотрудник КАК Сотрудник,
		|	ДисциплинарноеВзыскание.Взыскание КАК Взыскание,
		|	ДисциплинарноеВзыскание.ФизическоеЛицо КАК ФизическоеЛицо,
		|	ДокументДисциплинарноеВзыскание.Организация КАК Организация,
		|	ДисциплинарноеВзыскание.ДатаОкончания КАК ДатаОкончания
		|ИЗ
		|	Документ.ДисциплинарноеВзыскание.Сотрудники КАК ДисциплинарноеВзыскание
		|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ДисциплинарноеВзыскание КАК ДокументДисциплинарноеВзыскание
		|		ПО ДисциплинарноеВзыскание.Ссылка = ДокументДисциплинарноеВзыскание.Ссылка
		|ГДЕ
		|	ДисциплинарноеВзыскание.Ссылка = &Ссылка";
	
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	РезультатЗапроса = Запрос.Выполнить();
	ДвиженияДисциплинарногоВзыскания = РезультатЗапроса.Выгрузить();
	
	ДанныеДляПроведения = Новый Структура;
	ДанныеДляПроведения.Вставить("ДвиженияДисциплинарногоВзыскания", ДвиженияДисциплинарногоВзыскания);
	
	Если ОбщегоНазначения.ПодсистемаСуществует("ЗарплатаКадрыКорпоративнаяПодсистемы.Наставничество") Тогда
		МодульНаставничество = ОбщегоНазначения.ОбщийМодуль("Наставничество");
		МодульНаставничество.ДополнитьДанныеДляПроведенияДисциплинарногоВзыскания(Ссылка, ДанныеДляПроведения);
	КонецЕсли;
	
	Возврат ДанныеДляПроведения;
	
КонецФункции

#Область Печать

// Заполняет список команд печати.
// 
// Параметры:
//   КомандыПечати - ТаблицаЗначений - состав полей см. в функции УправлениеПечатью.СоздатьКоллекциюКомандПечати.
//
Процедура ДобавитьКомандыПечати(КомандыПечати) Экспорт
	
	КомандаПечати = КомандыПечати.Добавить();
	КомандаПечати.Обработчик = "УправлениеПечатьюБЗККлиент.ВыполнитьКомандуПечати";
	КомандаПечати.МенеджерПечати = "Документ.ДисциплинарноеВзыскание";
	КомандаПечати.Идентификатор = Метаданные.Документы.ДисциплинарноеВзыскание.Макеты.ПФ_MXL_ДисциплинарныеВзыскания.Имя;
	КомандаПечати.Представление = Метаданные.Документы.ДисциплинарноеВзыскание.Макеты.ПФ_MXL_ДисциплинарныеВзыскания.Представление();
	КомандаПечати.ПроверкаПроведенияПередПечатью = Истина;
	
	КомандаПечати = КомандыПечати.Добавить();
	КомандаПечати.Обработчик = "УправлениеПечатьюБЗККлиент.ВыполнитьКомандуПечати";
	КомандаПечати.МенеджерПечати = "Документ.ДисциплинарноеВзыскание";
	КомандаПечати.Идентификатор = Метаданные.Документы.ДисциплинарноеВзыскание.Макеты.ПФ_MXL_ДисциплинарноеВзыскание.Имя;
	КомандаПечати.ДополнительныеПараметры.Вставить("ПечатьВсехПриказов", Истина);
	КомандаПечати.Представление = НСтр("ru = 'Приказы на каждого сотрудника в отдельности'");
	КомандаПечати.ПроверкаПроведенияПередПечатью = Истина;
	
	Если ОбщегоНазначения.ПодсистемаСуществует("ЗарплатаКадрыКорпоративнаяПодсистемы.Наставничество") Тогда
		МодульНаставничество = ОбщегоНазначения.ОбщийМодуль("Наставничество");
		МодульНаставничество.ДобавитьКомандыПечатиПоОтменеНаставничества(КомандыПечати);
	КонецЕсли;
	
КонецПроцедуры

// Формирует печатные формы
//
// Параметры:
//  Для чтения:
//    МассивОбъектов  - Массив    - Ссылки на объекты, которые нужно распечатать;
//    ПараметрыПечати - Структура - Настройки печати;
//  Для изменения:
//    КоллекцияПечатныхФорм - ТаблицаЗначений - Табличные документы.
//    ОбъектыПечати         - СписокЗначений  - Разбивка областей табличного документа по напечатанным объектам.
//        * Значение            - Ссылка объекта;
//        * Представление       - Имя области в которой был выведен объект;
//    ПараметрыВывода       - Структура       - Параметры сформированных табличных документов.
//
Процедура Печать(МассивОбъектов, ПараметрыПечати, КоллекцияПечатныхФорм, ОбъектыПечати, ПараметрыВывода) Экспорт
	
	УправлениеПечатьюБЗК.Печать(МассивОбъектов, ПараметрыПечати, КоллекцияПечатныхФорм, ОбъектыПечати, Документы.ДисциплинарноеВзыскание);
	
КонецПроцедуры

// Формирует печатную форму. Вызывается из УправлениеПечатьюБЗК.Печать.
//
// Параметры:
//   КонтекстПечати - Структура - См. УправлениеПечатьюБЗК.КонтекстПечати.
//
Процедура ПриФормированииПечатнойФормы(КонтекстПечати) Экспорт
	
	Если КонтекстПечати.МетаданныеМакета = Метаданные.Документы.ДисциплинарноеВзыскание.Макеты.ПФ_MXL_ДисциплинарныеВзыскания Тогда
		ПриПечатиДисциплинарныхВзысканий(КонтекстПечати);
	ИначеЕсли КонтекстПечати.МетаданныеМакета = Метаданные.Документы.ДисциплинарноеВзыскание.Макеты.ПФ_MXL_ДисциплинарноеВзыскание Тогда
		ПриПечатиДисциплинарногоВзыскания(КонтекстПечати);
	КонецЕсли;
	
КонецПроцедуры

Функция ДанныеДляПечатиДисциплинарныхВзысканий(МассивСсылок)
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
	
	Запрос.УстановитьПараметр("МассивСсылок", МассивСсылок);
	
	Запрос.Текст =
		"ВЫБРАТЬ
		|	ДокументДисциплинарноеВзыскание.Ссылка КАК Ссылка,
		|	ДокументДисциплинарноеВзыскание.Номер КАК НомерДок,
		|	ДокументДисциплинарноеВзыскание.Дата,
		|	ДокументДисциплинарноеВзыскание.Дата КАК Период,
		|	ДокументДисциплинарноеВзыскание.Дата КАК ДатаДок,
		|	ДокументДисциплинарноеВзыскание.Организация КАК Организация,
		|	ДокументДисциплинарноеВзыскание.Руководитель КАК Руководитель,
		|	ДокументДисциплинарноеВзыскание.ДолжностьРуководителя КАК ДолжностьРуководителя,
		|	ДокументДисциплинарноеВзыскание.РаботникКадровойСлужбы КАК РаботникКадровойСлужбы,
		|	ДокументДисциплинарноеВзыскание.ДолжностьРаботникаКадровойСлужбы КАК ДолжностьРаботникаКадровойСлужбы,
		|	ДисциплинарноеВзыскание.Сотрудник КАК Сотрудник,
		|	ДисциплинарноеВзыскание.Взыскание КАК Взыскание
		|ПОМЕСТИТЬ ВТДанныеДокументов
		|ИЗ
		|	Документ.ДисциплинарноеВзыскание.Сотрудники КАК ДисциплинарноеВзыскание
		|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ДисциплинарноеВзыскание КАК ДокументДисциплинарноеВзыскание
		|		ПО ДисциплинарноеВзыскание.Ссылка = ДокументДисциплинарноеВзыскание.Ссылка
		|ГДЕ
		|	ДисциплинарноеВзыскание.Ссылка В(&МассивСсылок)";
	
	Запрос.Выполнить();
	
	ОписательВременныхТаблиц = КадровыйУчет.ОписательВременныхТаблицДляСоздатьВТКадровыеДанныеСотрудников(Запрос.МенеджерВременныхТаблиц, "ВТДанныеДокументов");
	КадровыйУчет.СоздатьВТКадровыеДанныеСотрудников(ОписательВременныхТаблиц, Истина, "ФИОПолные,Должность");
	
	ЗарплатаКадры.СоздатьВТФИООтветственныхЛиц(Запрос.МенеджерВременныхТаблиц, Истина, "Руководитель,РаботникКадровойСлужбы", "ВТДанныеДокументов");
	
	Запрос.Текст =
		"ВЫБРАТЬ
		|	ДанныеДокументов.Ссылка КАК Ссылка,
		|	ДанныеДокументов.НомерДок КАК НомерДок,
		|	ДанныеДокументов.ДатаДок КАК ДатаДок,
		|	СправочникОрганизации.НаименованиеПолное КАК ОрганизацияНаименованиеПолное,
		|	СправочникОрганизации.НаименованиеСокращенное КАК ОрганизацияНаименованиеСокращенное,
		|	СправочникВзыскания.Наименование КАК НаименованиеВзыскания,
		|	КадровыеДанныеСотрудников.ФИОПолные КАК ФИОРаботника,
		|	СправочникДолжности.Наименование КАК ДолжностьРаботника,
		|	ПРЕДСТАВЛЕНИЕ(СправочникВзыскания.ВидВзыскания) КАК ВидВзыскания,
		|	ДанныеДокументов.Руководитель КАК Руководитель,
		|	ДанныеДокументов.ДолжностьРуководителя КАК ДолжностьРуководителя,
		|	ФИОРуководителя.РасшифровкаПодписи КАК РуководительРасшифровкаПодписи,
		|	ФИОИсполнителя.ФИОПолные КАК ФИОИсполнителя,
		|	ДанныеДокументов.РаботникКадровойСлужбы КАК РаботникКадровойСлужбы,
		|	ДанныеДокументов.ДолжностьРаботникаКадровойСлужбы КАК ДолжностьИсполнителя,
		|	ВЫРАЗИТЬ(ДанныеДокументов.РаботникКадровойСлужбы КАК Справочник.ФизическиеЛица).Пол КАК ПолИсполнителя
		|ИЗ
		|	ВТДанныеДокументов КАК ДанныеДокументов
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТКадровыеДанныеСотрудников КАК КадровыеДанныеСотрудников
		|			ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Должности КАК СправочникДолжности
		|			ПО КадровыеДанныеСотрудников.Должность = СправочникДолжности.Ссылка
		|		ПО ДанныеДокументов.Сотрудник = КадровыеДанныеСотрудников.Сотрудник
		|			И ДанныеДокументов.Период = КадровыеДанныеСотрудников.Период
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТФИООтветственныхЛиц КАК ФИОРуководителя
		|		ПО ДанныеДокументов.Ссылка = ФИОРуководителя.Ссылка
		|			И ДанныеДокументов.Руководитель = ФИОРуководителя.ФизическоеЛицо
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТФИООтветственныхЛиц КАК ФИОИсполнителя
		|		ПО ДанныеДокументов.Ссылка = ФИОИсполнителя.Ссылка
		|			И ДанныеДокументов.РаботникКадровойСлужбы = ФИОИсполнителя.ФизическоеЛицо
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Организации КАК СправочникОрганизации
		|		ПО ДанныеДокументов.Организация = СправочникОрганизации.Ссылка
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Взыскания КАК СправочникВзыскания
		|		ПО ДанныеДокументов.Взыскание = СправочникВзыскания.Ссылка";
	
	Возврат Запрос.Выполнить().Выбрать();
	
КонецФункции

Процедура ПриПечатиДисциплинарныхВзысканий(КонтекстПечати)
	
	ТабличныйДокумент = КонтекстПечати.ТабличныйДокумент;
	МассивОбъектов    = КонтекстПечати.МассивОбъектов;
	ОбъектыПечати     = КонтекстПечати.ОбъектыПечати;
	
	ДанныеДляПечати = ДанныеДляПечатиДисциплинарныхВзысканий(МассивОбъектов);
	Пока ДанныеДляПечати.СледующийПоЗначениюПоля("Ссылка") Цикл
		
		Если ТабличныйДокумент.ВысотаТаблицы > 0 Тогда
			ТабличныйДокумент.ВывестиГоризонтальныйРазделительСтраниц();
		КонецЕсли;
		
		НачалоФормы = ТабличныйДокумент.ВысотаТаблицы - 1;
		НомерПункта = 1;
		
		ВывестиШапкуДисциплинарныхВзысканий(КонтекстПечати, ДанныеДляПечати);
		
		Пока ДанныеДляПечати.Следующий() Цикл
			
			ВывестиПунктДисциплинарныхВзысканий(КонтекстПечати, ДанныеДляПечати, НомерПункта);
			
			НомерПункта = НомерПункта + 1;
			
		КонецЦикла;
		
		ВывестиПодвалДисциплинарныхВзысканий(КонтекстПечати, ДанныеДляПечати, НомерПункта);
		
		УправлениеПечатью.ЗадатьОбластьПечатиДокумента(ТабличныйДокумент, НачалоФормы, ОбъектыПечати, ДанныеДляПечати.Ссылка);
		
	КонецЦикла;
	
КонецПроцедуры

Функция ВывестиШапкуДисциплинарныхВзысканий(КонтекстПечати, ДанныеДляПечати)
	
	НастройкиПечатныхФорм = ЗарплатаКадры.НастройкиПечатныхФорм();
	
	ТабличныйДокумент       = КонтекстПечати.ТабличныйДокумент;
	Макет                   = КонтекстПечати.Макет;
	ИменаПараметровОбластей = КонтекстПечати.ИменаПараметровОбластей;
	
	ПараметрыШапки = Новый Структура(ИменаПараметровОбластей.Шапка);
	ЗаполнитьЗначенияСвойств(ПараметрыШапки, ДанныеДляПечати);
	
	Если НастройкиПечатныхФорм.УдалятьПрефиксыОрганизацииИИБИзНомеровКадровыхПриказов Тогда
		ПараметрыШапки.НомерДок = ПрефиксацияОбъектовКлиентСервер.НомерНаПечать(ПараметрыШапки.НомерДок, Истина, Истина);
	КонецЕсли;
	
	ПараметрыШапки.ДатаДок = Формат(ПараметрыШапки.ДатаДок, "ДЛФ=DD");
	
	ОбластьШапка = Макет.ПолучитьОбласть("Шапка");
	ОбластьШапка.Параметры.Заполнить(ПараметрыШапки);
	ТабличныйДокумент.Вывести(ОбластьШапка);
	
КонецФункции

Функция ВывестиПунктДисциплинарныхВзысканий(КонтекстПечати, ДанныеДляПечати, НомерПункта)
	
	ТабличныйДокумент       = КонтекстПечати.ТабличныйДокумент;
	Макет                   = КонтекстПечати.Макет;
	ИменаПараметровОбластей = КонтекстПечати.ИменаПараметровОбластей;
	
	ПараметрыПункта = Новый Структура(ИменаПараметровОбластей.Взыскание);
	ЗаполнитьЗначенияСвойств(ПараметрыПункта, ДанныеДляПечати);
	
	ПараметрыПункта.НомерПункта = НомерПункта;
	ПараметрыПункта.НаименованиеВзыскания = НРег(ДанныеДляПечати.НаименованиеВзыскания);
	ПараметрыПункта.ДолжностьРаботника = СклонениеПредставленийОбъектов.ПросклонятьПредставление(НРег(ДанныеДляПечати.ДолжностьРаботника), 4, ДанныеДляПечати.ДолжностьРаботника);
	
	РезультатСклонения = "";
	Если ФизическиеЛицаЗарплатаКадры.Просклонять(Строка(ДанныеДляПечати.ФИОРаботника), 4, РезультатСклонения) Тогда
		ПараметрыПункта.ФИОРаботника = РезультатСклонения;
	КонецЕсли;
	
	ПараметрыПункта.ВидВзыскания = СклонениеПредставленийОбъектов.ПросклонятьПредставление(НРег(ДанныеДляПечати.ВидВзыскания), 2, ДанныеДляПечати.ВидВзыскания);
	
	ОбластьВзыскание = Макет.ПолучитьОбласть("Взыскание");
	ОбластьВзыскание.Параметры.Заполнить(ПараметрыПункта);
	ТабличныйДокумент.Вывести(ОбластьВзыскание);
	
КонецФункции

Функция ВывестиПодвалДисциплинарныхВзысканий(КонтекстПечати, ДанныеДляПечати, НомерПункта)
	
	ТабличныйДокумент       = КонтекстПечати.ТабличныйДокумент;
	Макет                   = КонтекстПечати.Макет;
	ИменаПараметровОбластей = КонтекстПечати.ИменаПараметровОбластей;
	
	ПараметрыПодвала = Новый Структура(ИменаПараметровОбластей.Подвал);
	ЗаполнитьЗначенияСвойств(ПараметрыПодвала, ДанныеДляПечати);
	
	ПараметрыПодвала.НомерПункта = НомерПункта;
	
	Если ЗначениеЗаполнено(ПараметрыПодвала.ФИОИсполнителя) Тогда
		РезультатСклонения = "";
		Если ФизическиеЛицаЗарплатаКадры.Просклонять(Строка(ПараметрыПодвала.ФИОИсполнителя), 4, РезультатСклонения, ДанныеДляПечати.ПолИсполнителя) Тогда
			ПараметрыПодвала.ФИОИсполнителя = РезультатСклонения;
		КонецЕсли;
	Иначе
		ПараметрыПодвала.ФИОИсполнителя = "____________________";
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(ПараметрыПодвала.ДолжностьИсполнителя) Тогда
		ПараметрыПодвала.ДолжностьИсполнителя = "____________________";
	КонецЕсли;
	
	ОбластьПодвал = Макет.ПолучитьОбласть("Подвал");
	ОбластьПодвал.Параметры.Заполнить(ПараметрыПодвала);
	ТабличныйДокумент.Вывести(ОбластьПодвал);
	
КонецФункции

Процедура ПриПечатиДисциплинарногоВзыскания(КонтекстПечати)
	
	ТабличныйДокумент = КонтекстПечати.ТабличныйДокумент;
	МассивОбъектов    = КонтекстПечати.МассивОбъектов;
	ОбъектыПечати     = КонтекстПечати.ОбъектыПечати;
	
	ДанныеДляПечати = ДанныеДляПечатиДисциплинарныхВзысканий(МассивОбъектов);
	Пока ДанныеДляПечати.Следующий() Цикл
		
		Если ТабличныйДокумент.ВысотаТаблицы > 0 Тогда
			ТабличныйДокумент.ВывестиГоризонтальныйРазделительСтраниц();
		КонецЕсли;
		
		НачалоФормы = ТабличныйДокумент.ВысотаТаблицы - 1;
		НомерПункта = 1;
		
		// В шапке выводится один и тот же номер.
		// Нужно сделать дробную часть. Например, 1/1, 1/2 и тд.
		ВывестиШапкуДисциплинарногоВзыскания(КонтекстПечати, ДанныеДляПечати);
			
		ВывестиПунктДисциплинарногоВзыскания(КонтекстПечати, ДанныеДляПечати, НомерПункта);
		НомерПункта = НомерПункта + 1;
		
		ВывестиПодвалДисциплинарногоВзыскания(КонтекстПечати, ДанныеДляПечати, НомерПункта);
		
		УправлениеПечатью.ЗадатьОбластьПечатиДокумента(ТабличныйДокумент, НачалоФормы, ОбъектыПечати, ДанныеДляПечати.Ссылка);
		
	КонецЦикла;
	
КонецПроцедуры

Функция ВывестиШапкуДисциплинарногоВзыскания(КонтекстПечати, ДанныеДляПечати)
	
	НастройкиПечатныхФорм = ЗарплатаКадры.НастройкиПечатныхФорм();
	
	ТабличныйДокумент       = КонтекстПечати.ТабличныйДокумент;
	Макет                   = КонтекстПечати.Макет;
	ИменаПараметровОбластей = КонтекстПечати.ИменаПараметровОбластей;
	
	ПараметрыШапки = Новый Структура(ИменаПараметровОбластей.Шапка);
	ЗаполнитьЗначенияСвойств(ПараметрыШапки, ДанныеДляПечати);
	
	Если НастройкиПечатныхФорм.УдалятьПрефиксыОрганизацииИИБИзНомеровКадровыхПриказов Тогда
		ПараметрыШапки.НомерДок = ПрефиксацияОбъектовКлиентСервер.НомерНаПечать(ПараметрыШапки.НомерДок, Истина, Истина);
	КонецЕсли;
	
	ПараметрыШапки.ДатаДок = Формат(ПараметрыШапки.ДатаДок, "ДЛФ=DD");
	ПараметрыШапки.ДолжностьРаботника = НРег(ПараметрыШапки.ДолжностьРаботника);
	ПараметрыШапки.НаименованиеВзыскания = НРег(ПараметрыШапки.НаименованиеВзыскания);
	
	ОбластьШапка = Макет.ПолучитьОбласть("Шапка");
	ОбластьШапка.Параметры.Заполнить(ПараметрыШапки);
	ТабличныйДокумент.Вывести(ОбластьШапка);
	
КонецФункции

Функция ВывестиПунктДисциплинарногоВзыскания(КонтекстПечати, ДанныеДляПечати, НомерПункта)
	
	ТабличныйДокумент       = КонтекстПечати.ТабличныйДокумент;
	Макет                   = КонтекстПечати.Макет;
	ИменаПараметровОбластей = КонтекстПечати.ИменаПараметровОбластей;
	
	ПараметрыПункта = Новый Структура(ИменаПараметровОбластей.Взыскание);
	ЗаполнитьЗначенияСвойств(ПараметрыПункта, ДанныеДляПечати);
	
	ПараметрыПункта.НомерПункта = НомерПункта;
	ПараметрыПункта.ВидВзыскания = СклонениеПредставленийОбъектов.ПросклонятьПредставление(НРег(ДанныеДляПечати.ВидВзыскания), 2, ДанныеДляПечати.ВидВзыскания);
	
	ОбластьВзыскание = Макет.ПолучитьОбласть("Взыскание");
	ОбластьВзыскание.Параметры.Заполнить(ПараметрыПункта);
	ТабличныйДокумент.Вывести(ОбластьВзыскание);
	
КонецФункции

Функция ВывестиПодвалДисциплинарногоВзыскания(КонтекстПечати, ДанныеДляПечати, НомерПункта)
	
	ТабличныйДокумент       = КонтекстПечати.ТабличныйДокумент;
	Макет                   = КонтекстПечати.Макет;
	ИменаПараметровОбластей = КонтекстПечати.ИменаПараметровОбластей;
	
	ПараметрыПодвала = Новый Структура(ИменаПараметровОбластей.Подвал);
	ЗаполнитьЗначенияСвойств(ПараметрыПодвала, ДанныеДляПечати);
	
	ПараметрыПодвала.НомерПункта = НомерПункта;
	
	Если ЗначениеЗаполнено(ПараметрыПодвала.ФИОИсполнителя) Тогда
		РезультатСклонения = "";
		Если ФизическиеЛицаЗарплатаКадры.Просклонять(Строка(ПараметрыПодвала.ФИОИсполнителя), 4, РезультатСклонения, ДанныеДляПечати.ПолИсполнителя) Тогда
			ПараметрыПодвала.ФИОИсполнителя = РезультатСклонения;
		КонецЕсли;
	Иначе
		ПараметрыПодвала.ФИОИсполнителя = "____________________";
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(ПараметрыПодвала.ДолжностьИсполнителя) Тогда
		ПараметрыПодвала.ДолжностьИсполнителя = "____________________";
	КонецЕсли;
	
	ОбластьПодвал = Макет.ПолучитьОбласть("Подвал");
	ОбластьПодвал.Параметры.Заполнить(ПараметрыПодвала);
	ТабличныйДокумент.Вывести(ОбластьПодвал);
	
КонецФункции

#КонецОбласти

#КонецОбласти

#КонецЕсли
